/* If a X500 name has a description and a common name we display CommonName (Description) using this format string */
"%@ (%@)" = "%1$@ (%2$@)";

/* Format string used to build a list of values, first argument is list second argument is to be appended element */
"%@, %@" = "%1$@, %2$@";

/* Format string for encoded field data (e.g. Sequence; 128 bytes; data = 00 00 ...) */
"%@; %d %@; data = %@" = "%1$@; %2$d %3$@; dữ liệu = %4$@";

/* format string to turn version number into a string */
"%d" = "%d";

/* Value of a field if its length is 0 */
"<NULL>" = "<NULL>";

/* CRL Distribution Points extension supported reason name */
"AA Compromise" = "Thỏa hiệp AA";

/* Label of field in authority info access extension */
"Access Location" = "Truy cập Vị trí";

/* Label of field in authority info access extension */
"Access Method" = "Truy cập Phương pháp";

/* CRL Distribution Points extension supported reason name */
"Affiliation Changed" = "Đã thay đổi Mối quan hệ";

/* Label of the algorithm subfield of an AlgorithmIdentifer */
"Algorithm" = "Thuật toán";

/* Label of field in Authority Key Identifier extension */
"Authority Certificate Serial Number" = "Số Sê ri Chứng nhận Ủy quyền";

/* Authority info access extension label */
"Authority Information Access" = "Truy cập Thông tin Ủy quyền";

/* Authority Key Identifier extension label */
"Authority Key Identifier" = "Định danh Khóa Quyền";

/* Label used for Basic Constraints when value is invalid */
"Basic Constraints" = "Những hạn chế Cơ bản";

/* First argument to SEC_BLOB_KEY format string for a bit string */
"Bit string" = "Chuỗi bit";

/* No comment provided by engineer. */
"bits" = "bit";

/* First argument to SEC_BLOB_KEY format string for a Byte string */
"Byte string" = "Chuỗi byte";

/* Third argument to SEC_BLOB_KEY format string for a byte string */
"bytes" = "byte";

/* CRL Distribution Points extension supported reason name */
"CA Compromise" = "Thỏa hiệp CA";

/* X.509 key usage bitfield name */
"Cert Sign" = "Dấu hiệu Chứng nhận";

/* Label for boolean is_ca property of a basic constraints extension */
"Certificate Authority" = "Quyền Chứng nhận";

/* CRL Distribution Points extension supported reason name */
"Certificate Hold" = "Giữ Chứng nhận";

/* Certificate Policies extension label */
"Certificate Policies" = "Chính sách Chứng nhận";

/* No comment provided by engineer. */
"Certificate Type" = "Loại Chứng nhận";

/* CRL Distribution Points extension supported reason name */
"Cessation Of Operation" = "Ngừng Hoạt động";

/* Label of field in Certificate Policies extension */
"CPS URI" = "CPS URI";

/* Label of field in extension that indicates whether this extension is critical */
"Critical" = "Quan trọng";

/* CRL Distribution Points extension label */
"CRL Distribution Points" = "Điểm Phân phối CRL";

/* Label for CRL issuer field of CRL Distribution Points extension */
"CRL Issuer" = "Nơi cấp CRL";

/* X.509 key usage bitfield name */
"CRL Sign" = "Dấu hiệu CRL";

/* Label for raw data of extension (used for unknown extensions) */
"Data" = "Dữ liệu";

/* X.509 key usage bitfield name */
"Data Encipherment" = "Mã hóa Dữ liệu";

/* X.509 key usage bitfield name */
"Decipher Only" = "Chỉ Giải mã";

/* X.509 key usage bitfield name */
"Digital Signature" = "Chữ ký Số";

/* label for general name field value */
"Directory Name" = "Tên Thư mục";

/* label for general name field value */
"DNS Name" = "Tên DNS";

/* label for general name field value */
"EDI Party Name" = "Tên Bên EDI";

/* label for general name field value */
"Email Address" = "Địa chỉ Email";

/* X.509 key usage bitfield name */
"Encipher Only" = "Chỉ Mã hóa";

/* No comment provided by engineer. */
"Expired" = "Đã hết hạn";

/* Label of expiration date value when certificate is temporally valid */
"Expires" = "Hết hạn";

/* Label of field in Certificate Policies extension */
"Explicit Text" = "Văn bản Rõ ràng";

/* Extended key usage extension label */
"Extended Key Usage" = "Sử dụng Khóa Mở rộng";

/* Label used for General Name entry when value is invalid */
"General Name" = "Tên Chung";

/* Label used for General Names when value is invalid */
"General Names" = "Tên Chung";

/* No comment provided by engineer. */
"Hostname mismatch." = "Tên máy chủ không khớp.";

/* Label of field in policy constraints extension */
"Inhibit Policy Mapping" = "Vạch ra Chính sách Ngăn cấm";

/* Label of a value is printed into this string if the data is not valid */
"Invalid %@" = "Không hợp lệ %@";

/* No comment provided by engineer. */
"Invalid certificate chain linkage." = "Liên kết chuỗi chứng nhận không hợp lệ.";

/* label for general name field value */
"IP Address" = "Địa chỉ IP";

/* No comment provided by engineer. */
"Issued By" = "Được cấp Bởi";

/* No comment provided by engineer. */
"Issuer Name" = "Tên Nơi cấp";

/* No comment provided by engineer. */
"Issuer Summary" = "Tóm tắt Nơi cấp";

/* No comment provided by engineer. */
"Issuer Unique ID" = "ID Duy nhất của Nơi cấp";

/* X.509 key usage bitfield name */
"Key Agreement" = "Thỏa thuận Khóa";

/* CRL Distribution Points extension supported reason name */
"Key Compromise" = "Thỏa hiệp Khóa";

/* X.509 key usage bitfield name */
"Key Encipherment" = "Mã hóa Khóa";

/* Label of field in Subject or Authority Key Identifier extension */
"Key Identifier" = "Định danh Khóa";

/* Subsection label in CRL Distribution Points extension. */
"Name Relative To CRL Issuer" = "Tên Liên quan đến Nơi cấp CRL";

/* Value for a boolean property when it's value is false (example critical: no) */
"No" = "Ko";

/* X.509 key usage bitfield name */
"Non-Repudiation" = "Không Từ chối";

/* field value of parameters field when no parameters are present */
"none" = "không";

/* format string for undisplayed field data with a given DER tag and length */
"not displayed (tag = %@; length %d)" = "không hiển thị (thẻ = %1$@; độ dài %2$d)";

/* label indicating the date after which something is no longer valid */
"Not Valid After" = "Không có Hiệu lực Sau";

/* label indicating the soonest date at which something is valid */
"Not Valid Before" = "Không có Hiệu lực Trước";

/* Label of field in Certificate Policies extension */
"Notice Numbers" = "Số Thông báo";

/* Netscape certificate type usage value */
"Object Signing" = "Xác thực Đối tượng";

/* Netscape certificate type usage value */
"Object Signing CA" = "Xác thực Đối tượng CA";

/* value of an oid field if it's length is more than what we allow for oids */
"Oid too long" = "Oid quá dài";

/* No comment provided by engineer. */
"One or more certificates have expired or are not valid yet." = "Một hoặc nhiều chứng nhận đã hết hạn hoặc không còn hiệu lực.";

/* No comment provided by engineer. */
"One or more unsupported critical extensions found." = "Tìm thấy một hoặc nhiều phần mở rộng quan trọng không được hỗ trợ.";

/* Label of field in Certificate Policies extension */
"Organization" = "Tổ chức";

/* Label used for Other Name RDN when value is invalid */
"Other Name" = "Tên Khác";

/* Label of the parameters subfield of an AlgorithmIdentifer */
"Parameters" = "Tham số";

/* Label for path length constraint property of a basic constraints extension */
"Path Length Constraint" = "Giới hạn Độ dài Đường dẫn";

/* Policy constraints extension label */
"Policy Constraints" = "Giới hạn Chính sách";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Identifier #%d" = "Định danh Chính sách #%d";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Qualifier #%d" = "Bộ hạn định Chính sách #%d";

/* No comment provided by engineer. */
"Policy requirements not met." = "Yêu cầu chính sách không được đáp ứng.";

/* Label for an invlaid private key se perion value */
"Private Key Usage Period" = "Thời gian Sử dụng Khóa Cá nhân";

/* CRL Distribution Points extension supported reason name */
"Privilege Withdrawn" = "Đặc quyền Đã rút";

/* No comment provided by engineer. */
"Public Key Algorithm" = "Thuật toán Khóa Công khai";

/* No comment provided by engineer. */
"Public Key Data" = "Dữ liệu Khóa Công khai";

/* Label of field in extended key usage extension */
"Purpose" = "Mục đích";

/* Label of field in Certificate Policies extension */
"Qualifier" = "Bộ hạn định";

/* Label of a RDN */
"RDN" = "RDN";

/* CRL Distribution Points extension supported reasons bitfield label */
"Reasons" = "Lý do";

/* label for general name field value */
"Registered ID" = "ID đã Đăng ký";

/* Label of field in policy constraints extension */
"Require Explicit Policy" = "Yêu cầu Chính sách Rõ ràng";

/* Netscape certificate type usage value */
"Reserved" = "Được bảo lưu";

/* No comment provided by engineer. */
"Root certificate is not trusted." = "Chứng nhận gốc không được tin cậy.";

/* Netscape certificate type usage value */
"S/MIME" = "S/MIME";

/* Netscape certificate type usage value */
"S/MIME CA" = "S/MIME CA";

/* First argument to SEC_BLOB_KEY format string for a Sequence */
"Sequence" = "Chuỗi";

/* No comment provided by engineer. */
"Serial Number" = "Số Sê ri";

/* First argument to SEC_BLOB_KEY format string for a Set */
"Set" = "T.lập";

/* No comment provided by engineer. */
"Signature" = "Chữ ký";

/* No comment provided by engineer. */
"Signature Algorithm" = "Thuật toán Chữ ký";

/* Netscape certificate type usage value */
"SSL CA" = "SSL CA";

/* Netscape certificate type usage value */
"SSL client" = "Máy khách SSL";

/* Netscape certificate type usage value */
"SSL server" = "Máy chủ SSL";

/* Subject Key Identifier extension label */
"Subject Key Identifier" = "Định danh Khóa Chủ đề";

/* No comment provided by engineer. */
"Subject Name" = "Tên Chủ đề";

/* No comment provided by engineer. */
"Subject Unique ID" = "ID Duy nhất của Chủ đề";

/* CRL Distribution Points extension supported reason name */
"Superseded" = "Được thay thế";

/* No comment provided by engineer. */
"This certificate has an issuer that has expired" = "Chứng nhận này có nơi cấp đã hết hạn";

/* No comment provided by engineer. */
"This certificate has an issuer that is not yet valid" = "Chứng nhận này có nơi cấp chưa hợp lệ";

/* No comment provided by engineer. */
"This certificate has expired" = "Chứng nhận này đã hết hạn";

/* No comment provided by engineer. */
"This certificate is not yet valid" = "Chứng nhận này chưa hợp lệ";

/* The certificate is temporally valid */
"This certificate is valid" = "Chứng nhận này hợp lệ";

/* Label of a value is printed into this string if the data can not been parsed according to it's type */
"Unparsed %@" = "Đã phân tích %@";

/* CRL Distribution Points extension supported reason name */
"Unused" = "Không dùng";

/* label for general name field value */
"URI" = "URI";

/* Label for KeyUsage bitfield values */
"Usage" = "Sử dụng";

/* No comment provided by engineer. */
"Valid from" = "Có hiệu lực từ";

/* No comment provided by engineer. */
"Version" = "Phiên bản";

/* label for general name field value */
"X.400 Address" = "Địa chỉ X.400";

/* Label of a X.501 Name */
"X.501 Name" = "X.501 Tên";

/* No comment provided by engineer. */
"X.509 version %d %scertificate" = "X.509 phiên bản %1$d %2$schứng nhận";

/* Value for a boolean property when it's value is true (example critical: yes) */
"Yes" = "Có";

